// დავალება 1
// დაწერეთ ალგორითმი, რომელიც იპოვის და დაბეჭდავს ერეიში 
// მაქსიმუმის და მინიმუმის მნიშვნელობას. ერეიში ელემენტების რაოდენობა განუსაზღვრელია, ერეის ყველა ელემენტი არის number ტიპის.


let arr=[14, 2, 45, 13, 54, 66, 21, 40];
var max = Math.max(...arr);
var min=Math.min(...arr);
console.log(max);
console.log(min)


// დავალება 2

// დაწერეთ ფუნქცია, რომელიც პარამეტრად მიიღებს ორ რიცხვს და დააბრუნებს (პირველი პარამეტრი ხარისხად მეორე პარამეტრის) მნიშვნელობას
// მაგ: გადაცემული პარამეტრები 2, 3 => 8 ან 4, 2 => 16;
// დაბრუნებული მნიშვნელობა შეინახეთ ცვლადში და შემდეგ დალოგეთ კონსოლში.

function myFunc(x, y){
    let a=Math.pow(x, y);
    return a;  
}
console.log(myFunc(2,3))


// დავალება 3
const myFunc2= (a, b)=>{
    let c =Math.pow(a,b)
    return c;
}
console.log(myFunc2(4,2));